autotools/autotools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>autotools</title>
<!-- 2017-12-19 Tue 19:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">autotools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 样例代码</a></li>
<li><a href="#sec-2">2. 加入autotools</a>
<ul>
<li><a href="#sec-2-1">2.1. 建立configure.ac</a></li>
<li><a href="#sec-2-2">2.2. 手写Makefile.am</a></li>
<li><a href="#sec-2-3">2.3. 建立必须的文件</a></li>
<li><a href="#sec-2-4">2.4. 执行libtoolize</a></li>
<li><a href="#sec-2-5">2.5. 执行autoreconf</a></li>
<li><a href="#sec-2-6">2.6. 至此autotools已经引入完毕</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
这里给出一个使用autotools的简单例子。<br  />
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 样例代码</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<label class="org-src-name">hello.c</label>
<pre class="src src-c"><span style="color: #40883f; font-weight: bold;">#include</span><span style="color: #b85c57;">&lt;stdio.h&gt;</span>

<span style="color: #0287c8; font-weight: bold;">int</span> <span style="color: #424242; font-weight: bold;">foo</span>();

<span style="color: #0287c8; font-weight: bold;">int</span> <span style="color: #424242; font-weight: bold;">main</span>()
{
    <span style="color: #989848;">return</span> foo();
}
</pre>
</div>


<div class="org-src-container">
<label class="org-src-name">foo.c</label>
<pre class="src src-c"><span style="color: #40883f; font-weight: bold;">#include</span><span style="color: #b85c57;">&lt;stdio.h&gt;</span>

<span style="color: #0287c8; font-weight: bold;">int</span> <span style="color: #424242; font-weight: bold;">foo</span>()
{
    printf(<span style="color: #b85c57;">"foo"</span>);
    <span style="color: #989848;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 加入autotools</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 建立configure.ac</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>生成configure.ac, 执行如下两条命令<br  />

<div class="org-src-container">

<pre class="src src-shell">autoscan
mv configure.scan configure.ac
</pre>
</div>
</li>

<li>修改configure.ac<br  />
<code>AC_INIT</code> 后面新增3行:<br  />

<ul class="org-ul">
<li><code>AM_INIT_AUTOMAKE([-Wall])</code><br  />
</li>
<li><code>LT_INIT</code><br  />
</li>
<li><code>AC_CONFIG_MACRO_DIRS([m4])</code><br  />
</li>
</ul>
<p>
<code>AC_OUTPUT</code> 前面新增1行:<br  />
</p>
<ul class="org-ul">
<li><code>AC_CONFIG_FILES([Makefile])</code><br  />
</li>
</ul>
<p>
最终结果如下:<br  />
</p>

<div class="org-src-container">

<pre class="src src-shell">#                                               -*- Autoconf -*-
# Process this file with autoconf to produce a configure script.

AC_PREREQ([2.69])
AC_INIT([FULL-PACKAGE-NAME], [VERSION], [BUG-REPORT-ADDRESS])

# init Automake 
AM_INIT_AUTOMAKE([-Wall]) 
# init Libtool
LT_INIT

AC_CONFIG_MACRO_DIRS([m4])

AC_CONFIG_SRCDIR([hello.c])
AC_CONFIG_HEADERS([config.h])

# Checks for programs.
AC_PROG_CC

# Checks for libraries.

# Checks for header files.

# Checks for typedefs, structures, and compiler characteristics.

# Checks for library functions.

AC_CONFIG_FILES([Makefile])

AC_OUTPUT
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 手写Makefile.am</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-shell">ACLOCAL_AMFLAGS = -I m4

# _LTLIBRARIES 是 Automake 支持 Libtool 的原语
lib_LTLIBRARIES = libfoo.la 
libfoo_la_SOURCES = foo.c 
# 可以通过 _LDFLAGS 传递选项给 Libtool 
libfoo_la_LDFLAGS = 
# 通过 _LIBADD 可以指定库依赖关系
libfoo_la_LIBADD  =
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 建立必须的文件</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-shell">touch NEWS README AUTHORS ChangeLog
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 执行libtoolize</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-shell">liboolize
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 执行autoreconf</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-shell">autoreconf -s -i
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 至此autotools已经引入完毕</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">

<pre class="src src-shell">./configure
make          # 这一步已经生成了libfoo.la和.libs/libfoo.so

libtool --mode=compile gcc -g -O -c hello.c
libtool --mode=link gcc -g -O -o hello hello.lo libfoo.la
./hello      # 打印出foo
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-12-19 Tue 19:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>